fluidized_bed_reactor/0.orig/alpha.gas
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      alpha.gas;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
#include "${FOAM_CASE}/constant/globalVars"

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 1;

boundaryField
{
    gasinlet
    {
        type   zeroGradient;
    }

    solidsinlet
    {
        type            fixedValue;
        value           uniform $gasInletFrac;
    }

    outlet
    {
        type            zeroGradient;
    }

    pyrowall
    {
        type            zeroGradient;
    }
    
    adwall
    {
        type            zeroGradient;
    }

    frontback
    {
        type            empty;
    }
}

// ************************************************************************* //
