fluidized_bed_reactor/Allrun
#!/bin/sh
blockMesh
cp -r 0.orig 0
setFields
multiphaseEulerFoam
